app/channels/application_cable/connection.rb

    def find_verified_user
      # Find user from session
      if verified_user = User.find_by(id: cookies.encrypted[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1