app/services/revenue_analytics_service.rb

  def top_supporters(limit = 10)
    succeeded_payments
      .where.not(user_id: nil)
      .group(:user_id)
      .select('user_id, SUM(amount_cents) as total_amount, COUNT(*) as payment_count')
      .order('total_amount DESC')
      .limit(limit)
      .map do |payment|
        {
          user: User.find(payment.user_id),
          total_amount: payment.total_amount / 100.0,
          payment_count: payment.payment_count
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1