app/services/subscription_service.rb

SELECT 1 AS one FROM "subscriptions" WHERE "subscriptions"."user_id" = 1 LIMIT 1
UPDATE "users" SET "updated_at" = '2025-10-07 16:26:49.695174', "stripe_customer_id" = 'cus_TC1mca7WrRQbHf' WHERE "users"."id" = 1
---
  def get_or_create_customer
    # Return existing customer ID if user has one
    return user.stripe_customer_id if user.stripe_customer_id.present?

    # Check if user has existing subscription with customer ID
    if user.subscriptions.any?
      customer_id = user.subscriptions.last.stripe_customer_id
      user.update!(stripe_customer_id: customer_id)
      return customer_id
    end

    # Create new Stripe customer
    customer = Stripe::Customer.create({
      email: user.email,
      name: user.username,
      metadata: {
        user_id: user.id
      }
    })

    # Save customer ID to user
    user.update!(stripe_customer_id: customer.id)