app/views/dashboard/index.html.erb

INSERT INTO "users" ("username", "email", "password_digest", "stream_key", "created_at", "updated_at", "subscription_tier") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
                <i class="bi bi-clock"></i>
                Account created <%= time_ago_in_words(current_user.created_at) %> ago