app/views/settings/index.html.erb

              <div style="font-size: 0.75rem; color: var(--text-muted); text-transform: uppercase; letter-spacing: 0.5px; margin-bottom: 0.5rem;">Member Since</div>
              <div style="font-size: 1rem; color: var(--text-secondary);"><%= @user.created_at.strftime("%B %d, %Y") %></div>
---
INSERT INTO "users" ("username", "email", "password_digest", "stream_key", "created_at", "updated_at", "subscription_tier") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"