app/views/settings/index.html.erb

          <%# Steam Integration %>
          <div class="glass-card mb-3" style="border: 1px solid <%= current_user.steam_account.present? ? 'rgba(139, 92, 246, 0.5)' : 'rgba(255, 255, 255, 0.1)' %>;">
---
SELECT "steam_accounts".* FROM "steam_accounts" WHERE "steam_accounts"."user_id" = 1 LIMIT 1