app/views/settings/index.html.erb

        <%# Steam Integration %>
        <div class="glass-card mb-3" style="border: 1px solid <%= current_user.steam_account.present? ? 'rgba(139, 92, 246, 0.5)' : 'rgba(255, 255, 255, 0.1)' %>; <%= current_user.steam_account.present? ? 'box-shadow: 0 4px 20px rgba(139, 92, 246, 0.2);' : '' %>">
---
SELECT "riot_accounts".* FROM "riot_accounts" WHERE "riot_accounts"."user_id" = 1 LIMIT 1
SELECT "steam_accounts".* FROM "steam_accounts" WHERE "steam_accounts"."user_id" = 1 LIMIT 1

        <%# Discord Integration %>
        <div class="glass-card mb-3" style="border: 1px solid <%= current_user.discord_account.present? ? 'rgba(139, 92, 246, 0.5)' : 'rgba(255, 255, 255, 0.1)' %>; <%= current_user.discord_account.present? ? 'box-shadow: 0 4px 20px rgba(139, 92, 246, 0.2);' : '' %>">
---
SELECT "discord_accounts".* FROM "discord_accounts" WHERE "discord_accounts"."user_id" = 1 LIMIT 1

        <%# Battle.net Integration %>
        <div class="glass-card mb-3" style="border: 1px solid <%= current_user.battlenet_account.present? ? 'rgba(139, 92, 246, 0.5)' : 'rgba(255, 255, 255, 0.1)' %>; <%= current_user.battlenet_account.present? ? 'box-shadow: 0 4px 20px rgba(139, 92, 246, 0.2);' : '' %>">
---
SELECT "battlenet_accounts".* FROM "battlenet_accounts" WHERE "battlenet_accounts"."user_id" = 1 LIMIT 1

        <%# Spotify Integration %>
        <div class="glass-card mb-3" style="border: 1px solid <%= current_user.spotify_account.present? ? 'rgba(139, 92, 246, 0.5)' : 'rgba(255, 255, 255, 0.1)' %>; <%= current_user.spotify_account.present? ? 'box-shadow: 0 4px 20px rgba(139, 92, 246, 0.2);' : '' %>">
---
SELECT "spotify_accounts".* FROM "spotify_accounts" WHERE "spotify_accounts"."user_id" = 1 LIMIT 1