app/services/integrations/battlenet_sync_service.rb

UPDATE "battlenet_accounts" SET "last_synced_at" = '2025-10-05 23:45:46.335268', "updated_at" = '2025-10-05 23:45:46.336242' WHERE "battlenet_accounts"."id" = 1
---
    def sync!
      ActiveRecord::Base.transaction do
        sync_account_info
        sync_game_profiles
      end

      battlenet_account.update!(last_synced_at: Time.current)