app/services/integrations/discord_sync_service.rb

UPDATE "discord_accounts" SET "last_synced_at" = '2025-10-05 22:48:53.215995', "updated_at" = '2025-10-05 22:48:53.216158' WHERE "discord_accounts"."id" = 1
---
    def sync!
      ActiveRecord::Base.transaction do
        sync_profile
      end

      discord_account.update!(last_synced_at: Time.current)