app/controllers/api/v1/loyalty_points_controller.rb

INSERT INTO "loyalty_points" ("user_id", "points", "level", "total_earned", "total_spent", "created_at", "updated_at") VALUES (1, 0, 1, 0, 0, '2025-10-07 18:43:40.853711', '2025-10-07 18:43:40.853711') RETURNING "id"
---
      def show
        loyalty_points = @user.loyalty_point || @user.create_loyalty_point!

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
      def set_user
        @user = User.find_by(id: params[:user_id])