app/controllers/api/v1/users_controller.rb

SELECT "discord_accounts".* FROM "discord_accounts" WHERE "discord_accounts"."discord_id" = '183305789467787264' LIMIT 1
---
      def show_by_discord_id
        discord_account = DiscordAccount.find_by(discord_id: params[:discord_id])