app/views/chat_messages/_message.html.erb

        <span style="font-weight: 600; color: var(--text-primary); font-size: 0.875rem;"><%= message.user.username %></span>
        <span style="font-size: 0.75rem; color: var(--text-muted);"><%= time_ago_in_words(message.created_at) %> ago</span>
---
INSERT INTO "chat_messages" ("user_id", "stream_id", "content", "created_at", "updated_at") VALUES (1, 1, 'test', '2025-10-06 01:08:05.739727', '2025-10-06 01:08:05.739727') RETURNING "id"