app/controllers/business_controller.rb

  def index
    # Load revenue analytics service
    @revenue_service = RevenueAnalyticsService.new(current_user)

    # Revenue metrics
    @total_revenue = @revenue_service.total_revenue
    @monthly_revenue = @revenue_service.current_month_revenue
    @revenue_by_type = @revenue_service.revenue_by_type
    @monthly_chart_data = @revenue_service.monthly_chart_data(12) # Last 12 months
    @top_supporters = @revenue_service.top_supporters(10)

    # Expense metrics (use 'date' field, not 'created_at')
    @total_expenses = current_user.expenses.sum(:amount_cents) rescue 0
    @monthly_expenses = current_user.expenses.where('date >= ?', Time.current.beginning_of_month).sum(:amount_cents) rescue 0

    # Profit calculations
    @total_profit = @total_revenue - @total_expenses
    @monthly_profit = @monthly_revenue - @monthly_expenses

    # Monthly expense chart data (for trends)
    @monthly_expense_data = monthly_expense_chart_data(current_user, 12)

    # Recent expenses
    @recent_expenses = current_user.expenses.order(date: :desc).limit(5) rescue []

    # Subscription metrics
    @active_subscriptions = current_user.received_payments
      .where(payment_type: 'subscription', status: 'succeeded')
      .where('created_at >= ?', 30.days.ago)
      .count

    @subscription_mrr = current_user.received_payments
      .where(payment_type: 'subscription', status: 'succeeded')
      .where('created_at >= ?', 30.days.ago)
      .sum(:amount_cents)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = 1 AND (date >= '2024-10-01 00:00:00')
SELECT SUM("expenses"."amount_cents") FROM "expenses" WHERE "expenses"."user_id" = 1
SELECT SUM("expenses"."amount_cents") FROM "expenses" WHERE "expenses"."user_id" = 1 AND (created_at >= '2025-10-01 00:00:00')
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = 1 ORDER BY "expenses"."date" DESC LIMIT 5
SELECT COUNT(*) FROM "payments" WHERE "payments"."recipient_id" = 1 AND "payments"."payment_type" = 'subscription' AND "payments"."status" = 'succeeded' AND (created_at >= '2025-09-07 22:11:29.070946')
SELECT SUM("payments"."amount_cents") FROM "payments" WHERE "payments"."recipient_id" = 1 AND "payments"."payment_type" = 'subscription' AND "payments"."status" = 'succeeded' AND (created_at >= '2025-09-07 22:11:29.071420')

  def monthly_expense_chart_data(user, months = 12)
    start_date = months.months.ago.beginning_of_month

    # Group expenses by month
    expenses_by_month = user.expenses
      .where('date >= ?', start_date)
      .group_by { |e| e.date.beginning_of_month }
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = 1 AND (date >= '2024-10-01 00:00:00')