app/controllers/chat_messages_controller.rb

INSERT INTO "chat_messages" ("user_id", "stream_id", "content", "created_at", "updated_at") VALUES (1, 1, 'test', '2025-10-06 01:08:05.739727', '2025-10-06 01:08:05.739727') RETURNING "id"
---
  def create
    @message = @stream.chat_messages.build(message_params)
    @message.user = current_user

    if @message.save

SELECT "streams".* FROM "streams" WHERE "streams"."id" = 1 LIMIT 1
---
  def set_stream
    @stream = Stream.find(params[:stream_id])