app/controllers/dashboard_controller.rb

INSERT INTO "streams" ("user_id", "title", "status", "stream_key", "playback_path", "created_at", "updated_at", "started_at", "ended_at", "duration_seconds", "viewer_count") VALUES (1, 'teststreamer''s Stream', 'offline', NULL, NULL, '2025-10-07 20:01:51.664353', '2025-10-07 20:01:51.664353', NULL, NULL, 0, 0) RETURNING "id"
SELECT "streams".* FROM "streams" WHERE "streams"."user_id" = 1 ORDER BY "streams"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "streams" WHERE "streams"."user_id" = 1
SELECT COUNT(*) FROM "streams" WHERE "streams"."user_id" = 1 AND "streams"."status" = 'live'
SELECT "steam_accounts".* FROM "steam_accounts" WHERE "steam_accounts"."user_id" = 1 LIMIT 1
SELECT "discord_accounts".* FROM "discord_accounts" WHERE "discord_accounts"."user_id" = 1 LIMIT 1
---
  def index
    # Get the current user's streams
    # @streams will be available in the view
    # Learn more about instance variables in views: https://guides.rubyonrails.org/action_view_overview.html
    @streams = current_user.streams

    # Get the user's primary stream (first one, or create if none exist)
    # Most users will have one main stream they broadcast to
    @stream = @streams.first || current_user.streams.create!(
      title: "#{current_user.username}'s Stream",
      status: "offline"
    )

    # Calculate streaming statistics
    # These will be displayed in dashboard cards
    @total_streams = @streams.count
    @active_streams = @streams.where(status: "live").count

    # Get subscription tier info for billing section
    @subscription = current_user.subscription_tier

    # Check integration connection status
    @steam_connected = current_user.steam_account.present?
    @discord_connected = current_user.discord_account.present?