app/controllers/dashboard_controller.rb

INSERT INTO "streams" ("user_id", "title", "status", "stream_key", "playback_path", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "users" ("username", "email", "password_digest", "stream_key", "created_at", "updated_at", "subscription_tier") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "streams".* FROM "streams" WHERE "streams"."user_id" = ? ORDER BY "streams"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "teststreamer"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "streams" WHERE "streams"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "streams" WHERE "streams"."user_id" = ? AND "streams"."status" = ?  [["user_id", 1], ["status", "live"]]
SELECT 1 AS one FROM "users" WHERE LOWER("users"."username") = LOWER(?) AND "users"."id" != ? LIMIT ?  [["username", "testuser"], ["id", 1], ["LIMIT", 1]]
---
  def index
    # Get the current user's streams
    # @streams will be available in the view
    # Learn more about instance variables in views: https://guides.rubyonrails.org/action_view_overview.html
    @streams = current_user.streams

    # Get the user's primary stream (first one, or create if none exist)
    # Most users will have one main stream they broadcast to
    @stream = @streams.first || current_user.streams.create!(
      title: "#{current_user.username}'s Stream",
      status: "offline"
    )

    # Calculate streaming statistics
    # These will be displayed in dashboard cards
    @total_streams = @streams.count
    @active_streams = @streams.where(status: "live").count

    # Get subscription tier info for billing section
    @subscription = current_user.subscription_tier

    # Check integration connection status
    @steam_connected = current_user.steam_account.present?