app/controllers/registrations_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "stream_key", "created_at", "updated_at", "subscription_tier") VALUES ('alex', 'alex.scholtes@icloud.com', '$2a$12$ocTwgnsnHHF4.GBPu7QVVuixAeKSubJ5BLza/CKlLR./iT6Abrbmq', NULL, '2025-10-02 11:30:17.804037', '2025-10-02 11:30:17.804037', 'free') RETURNING "id"
---
  def create
    # Build a new User object with parameters from the form
    # user_params is a private method that filters allowed parameters (strong parameters)
    # Learn more: https://guides.rubyonrails.org/action_controller_overview.html#strong-parameters
    @user = User.new(user_params)

    # Try to save the user to the database
    # save returns true if successful, false if validations fail
    if @user.save