app/controllers/registrations_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "stream_key", "created_at", "updated_at", "subscription_tier") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    # Build a new User object with parameters from the form
    # user_params is a private method that filters allowed parameters (strong parameters)
    # Learn more: https://guides.rubyonrails.org/action_controller_overview.html#strong-parameters
    @user = User.new(user_params)

    # Try to save the user to the database
    # save returns true if successful, false if validations fail
    if @user.save