app/controllers/rtmp_controller.rb

  def auth
    stream_key = params[:key] || params[:name] # MediaMTX can send either

    if stream_key.blank?
      Rails.logger.warn "RTMP Auth: No stream key provided"
      render plain: 'No stream key provided', status: :unauthorized
      return
    end

    # Find user by stream key
    user = User.find_by(stream_key: stream_key)
---
SELECT "users".* FROM "users" WHERE "users"."stream_key" = '7583a86e1cdcc6bc3c36df150030ecdb05cf5952' LIMIT 1

  def publish
    path = params[:path]
    stream_key = path&.gsub(%r{^/}, '') # Remove leading slash

    if stream_key.blank?
      Rails.logger.warn "Publish webhook: No path provided"
      render plain: 'No path provided', status: :bad_request
      return
    end

    user = User.find_by(stream_key: stream_key)

    unless user
      Rails.logger.error "Publish webhook: User not found for stream key #{stream_key[0..8]}..."
      render plain: 'User not found', status: :not_found
      return
    end

    Rails.logger.info "🔴 PUBLISH: #{user.username} started streaming (key: #{stream_key[0..8]}...)"

    # Create or find the stream
    stream = user.streams.find_or_initialize_by(stream_key: stream_key) do |s|
---
SELECT "users".* FROM "users" WHERE "users"."stream_key" = '7583a86e1cdcc6bc3c36df150030ecdb05cf5952' LIMIT 1
SELECT "streams".* FROM "streams" WHERE "streams"."user_id" = 2 AND "streams"."stream_key" = '7583a86e1cdcc6bc3c36df150030ecdb05cf5952' LIMIT 1

  def unpublish
    path = params[:path]
    stream_key = path&.gsub(%r{^/}, '') # Remove leading slash

    if stream_key.blank?
      Rails.logger.warn "Unpublish webhook: No path provided"
      render plain: 'No path provided', status: :bad_request
      return
    end

    user = User.find_by(stream_key: stream_key)

    unless user
      Rails.logger.error "Unpublish webhook: User not found for stream key"
      render plain: 'User not found', status: :not_found
      return
    end

    Rails.logger.info "⚫ UNPUBLISH: #{user.username} stopped streaming"

    # Find the active stream
    stream = user.streams.find_by(stream_key: stream_key, status: 'live')

    if stream
      duration = stream.started_at ? (Time.current - stream.started_at).to_i : 0

      stream.update!(
        status: 'offline',
        ended_at: Time.current,
        duration_seconds: duration
      )
---
SELECT "users".* FROM "users" WHERE "users"."stream_key" = '7583a86e1cdcc6bc3c36df150030ecdb05cf5952' LIMIT 1
SELECT "streams".* FROM "streams" WHERE "streams"."user_id" = 2 AND "streams"."stream_key" = '7583a86e1cdcc6bc3c36df150030ecdb05cf5952' AND "streams"."status" = 'live' LIMIT 1
UPDATE "streams" SET "status" = 'offline', "updated_at" = '2025-10-16 02:22:45.098249', "ended_at" = '2025-10-16 02:22:45.098109', "duration_seconds" = 11 WHERE "streams"."id" = 2