app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "testuser"], ["LIMIT", 1]]
---
  def create
    # Extract the username/email and password from params
    # params is a hash containing all form data and URL parameters
    # Learn more: https://guides.rubyonrails.org/action_controller_overview.html#parameters
    username_or_email = params[:session][:username]
    password = params[:session][:password]

    # Find user by username OR email
    # We use downcase to make the search case-insensitive
    # find_by returns nil if no user is found (doesn't raise an error)
    user = User.find_by(username: username_or_email.downcase) ||
           User.find_by(email: username_or_email.downcase)