app/controllers/settings_controller.rb

UPDATE "users" SET "stream_key" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["stream_key", "[FILTERED]"], ["updated_at", "2025-10-02 04:38:22.679669"], ["id", 1]]
---
  def update_profile
    # Get current user
    @user = current_user

    # user_profile_params filters allowed parameters (strong parameters)
    # This prevents users from modifying fields they shouldn't
    if @user.update(user_profile_params)

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2025-10-02 04:38:22.639953"], ["id", 1]]
---
  def update_password
    # Get current user
    @user = current_user

    # Verify current password before allowing change
    # This is a security measure to prevent unauthorized password changes
    # Learn more: https://guides.rubyonrails.org/security.html
    if @user.authenticate(password_params[:current_password])
      # Current password is correct, proceed with update

      # Update password with new values
      if @user.update(password: password_params[:password],
                      password_confirmation: password_params[:password_confirmation])