app/controllers/streams_controller.rb

SELECT "chat_messages".* FROM "chat_messages" WHERE "chat_messages"."stream_id" = 1 ORDER BY "chat_messages"."created_at" DESC LIMIT 100
---
  def show
    @related_streams = Stream.live
                             .where.not(id: @stream.id)
                             .limit(4)
                             .includes(:user)

    # Load recent chat messages
    @chat_messages = @stream.chat_messages
                            .includes(:user)
                            .order(created_at: :asc)
                            .last(100) # Show last 100 messages

SELECT "streams".* FROM "streams" WHERE "streams"."id" = 1 LIMIT 1
---
  def set_stream
    @stream = Stream.find(params[:id])