app/controllers/subscriptions_controller.rb

  def show
    @subscription = current_user.active_subscription || current_user.subscriptions.last
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = 1 ORDER BY "subscriptions"."id" DESC LIMIT 1