app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])

    # Load user's streams
    @streams = @user.streams.recent.limit(6)
    @live_streams = @user.streams.live
    @total_streams = @user.streams.count

    # Load integrations
    @steam_connected = @user.steam_account.present?
    @discord_connected = @user.discord_account.present?
    @battlenet_connected = @user.battlenet_account.present?
    @riot_connected = @user.riot_account.present?
    @twitter_connected = @user.twitter_account.present?
    @youtube_connected = @user.youtube_account.present?

    # Count connected integrations
    @connected_integrations = [
      @steam_connected,
      @discord_connected,
      @battlenet_connected,
      @riot_connected,
      @twitter_connected,
      @youtube_connected
    ].count(true)

    # Discord bot stats (if available)
    @loyalty_points = @user.loyalty_point&.points || 0
    @achievements_count = @user.user_achievements.count
    @total_achievements = Achievement.count
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "streams" WHERE "streams"."user_id" = 1
SELECT "riot_accounts".* FROM "riot_accounts" WHERE "riot_accounts"."user_id" = 1 LIMIT 1
SELECT "steam_accounts".* FROM "steam_accounts" WHERE "steam_accounts"."user_id" = 1 LIMIT 1
SELECT "discord_accounts".* FROM "discord_accounts" WHERE "discord_accounts"."user_id" = 1 LIMIT 1
SELECT "battlenet_accounts".* FROM "battlenet_accounts" WHERE "battlenet_accounts"."user_id" = 1 LIMIT 1
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = 1 LIMIT 1
SELECT "youtube_accounts".* FROM "youtube_accounts" WHERE "youtube_accounts"."user_id" = 1 LIMIT 1
SELECT COUNT(*) FROM "user_achievements" WHERE "user_achievements"."user_id" = 1
SELECT COUNT(*) FROM "achievements"