app/models/stream.rb

  def start_game_detection
    return unless user.steam_account.present?
---
SELECT "steam_accounts".* FROM "steam_accounts" WHERE "steam_accounts"."user_id" = 1 LIMIT 1