app/models/stream.rb

UPDATE "game_sessions" SET "ended_at" = '2025-10-16 02:22:45.104249' WHERE "game_sessions"."stream_id" = 2 AND "game_sessions"."ended_at" IS NULL
---
  def end_game_sessions
    game_sessions.where(ended_at: nil).update_all(ended_at: Time.current)