app/models/user.rb

  def downcase_username
    # self.username refers to the current object's username attribute
    # downcase! modifies the string in place (the ! means it modifies the original)
    self.username = username.downcase if username.present?
---
SELECT 1 AS one FROM "users" WHERE LOWER("users"."username") = LOWER('testuser') AND "users"."id" != 2 LIMIT 1

  def downcase_email
    self.email = email.downcase if email.present?
---
SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER('test@example.com') AND "users"."id" != 2 LIMIT 1