app/models/user.rb

SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER('alex.scholtes@icloud.com') AND "users"."id" != 1 LIMIT 1
---
  def downcase_email
    self.email = email.downcase if email.present?