app/controllers/concerns/authentication.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def current_user
    # ||= is the "or equals" operator (memoization pattern)
    # If @current_user is already set, return it
    # If @current_user is nil, execute the right side and store the result
    # This means we only query the database once per request
    # Learn more: https://www.justinweiss.com/articles/4-simple-memoization-patterns-in-ruby-and-one-gem/
    @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]