app/controllers/integrations/steam_controller.rb

INSERT INTO "steam_accounts" ("user_id", "steam_id", "persona_name", "profile_url", "avatar_url", "real_name", "country_code", "state_code", "visibility", "time_created", "last_logoff", "level", "access_token", "refresh_token", "token_expires_at", "last_synced_at", "created_at", "updated_at") VALUES (1, '76561198108458272', 'Th3MFG', 'https://steamcommunity.com/id/Th3MFG/', 'https://avatars.steamstatic.com/c56c312fb8484499359f1a1af769d19d491553c1_full.jpg', NULL, 'US', 'IN', 3, 1380122081, 1756948997, NULL, '{"p":"chrcLD3TFG55lTpS4nzg4JCQldq/vh+HjWnv0IagwZi+xUYgg9ApomPg6vWnHYry5bP2/GG1R2o=","h":{"iv":"F50gkVhOLCrQsAGb","at":"/8tN4YBbKjQ8MKGqhDz7vg=="}}', NULL, '2026-10-05 23:06:08.599270', NULL, '2025-10-05 23:06:08.611617', '2025-10-05 23:06:08.611617') RETURNING "id"
UPDATE "steam_accounts" SET "access_token" = '{"p":"MwE2fthlrtjNnMjtYOMB8cLnlpov/mU9vyRRgchWZkSvSE77fgQuT3oFriYMnD8rszmI/Y0zPE0=","h":{"iv":"6Uv+UkL3OALyQc4N","at":"p/ER9uQ4cZWXnq0ck6H0WQ=="}}', "token_expires_at" = '2026-10-05 23:12:21.233199', "updated_at" = '2025-10-05 23:12:21.268810' WHERE "steam_accounts"."id" = 1
---
    def create_or_update_integration_account(user_data, tokens)
      steam_account = current_user.steam_account || current_user.build_steam_account

      steam_account.assign_attributes(
        steam_id: user_data[:steam_id],
        persona_name: user_data[:persona_name],
        profile_url: user_data[:profile_url],
        avatar_url: user_data[:avatar_url],
        real_name: user_data[:real_name],
        country_code: user_data[:country_code],
        state_code: user_data[:state_code],
        visibility: user_data[:visibility],
        time_created: user_data[:time_created],
        last_logoff: user_data[:last_logoff],
        access_token: tokens[:access_token],
        refresh_token: tokens[:refresh_token],
        token_expires_at: tokens[:expires_at]
      )

      steam_account.save!